// 1. Өгөгдсөн массивын гишүүдийн нийлбэрийг ол.
function sum(arr) {
    let total = 0;
    for (let k = 0; k < arr.length; k++) {
        total += arr[k]}
    console.log (total);
}
const arr = [3, 6, 7, 12, 89, 100];
sum(arr);

// 2. Өгөгдсөн массивын 0-ээс их элементүүдийн нийлбэрийг ол.
function sumExclude0(arr) {
    let total = 0;
    for (let k = 0; k < arr.length; k++) {
        total += arr[k + 1]
    } console.log (total);
}

// 3. Өгөгдсөн массивын хамгийн бага элементийг ол.
const numbers = [3, 6, 7, 12, 89, 100];
const lowest = Math.min(...numbers);
console.log(lowest);

const elements = [23, 8, 746, 10, 56, 29];
const highest = Math.max(... elements)
console.log(highest);

// 4. Өгөгдсөн массивын хамгийн их элемент хэд дэх нь вэ? Хэрэв хамгийн их элементийн тоо 1-ээс олон бол бага дугаарыг нь хэвлэнэ.
const highestNumIndex = elements.indexOf(highest);
console.log(highestNumIndex);

// 5. Өгөгдсөн Массивийн элэментүүдийг эсрэг дарааллаар буцаа


// 6. Хөрш элэментүүдээсээ их буюу орой элэментүүдийн тоог буцаа
// 7. Өгөгдсөн массивийн бүх хосыг хэвлэ
// 8. Массив болон тоо өгөгдөв. Нийлбэр нь өгөгдсөн тоотой тэнцүү байдаг хосын тоог ол
// 9. Өгөгдсөн 2 массивийн огтлолцлыг ол
// 10. Өгөгдсөн массивийн сөрөг тоонуудыг зүүн талд нь байрлуул
// 11. Дараалсан тоонуудаас бүрдэх массив өгөгдөх байсан боловч 1 тоо нь дутуу байв. Тэр тоог ол